---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.DomainType
source: html/b9b42676-f45e-0352-0317-e015f9680274.htm
---
# Autodesk.Revit.DB.FabricationPart.DomainType Property

The domain type for the fabrication part.

## Syntax (C#)
```csharp
public ConnectorDomainType DomainType { get; }
```